PANDAS is an open source,High Performance, Easy to use data structure and data analysis 
tools for the python programming Languages

### What is Data Frame?
### What is Data Series?
### Different Operations in Python

In [6]:
import pandas as pd  # Importing pandas and numpy libraries
import numpy as np

In [7]:
# Creating a Dataframe (It is a combination of many rows and many columns ,
                       #it should be atleast more then 1 row and more than 1 column)

In [9]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=["column1","column2","column3","column4"])

In [10]:
df

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [12]:
df.to_csv('sampleCSV')

In [13]:
# Accessing Elements , THERE ARE 2 WAYS TO DO SO
#1).loc  2) .iloc

In [15]:
df.loc['row1']

column1    0
column2    1
column3    2
column4    3
Name: row1, dtype: int32

In [16]:
type(df.loc['row1'])  # result shows its series and not the dataframe since it includes just one row

pandas.core.series.Series

In [17]:
df.iloc[0:2,0:2]

      column1  column2
row1        0        1
row2        4        5

In [18]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [19]:
df.iloc[:,1:]

      column2  column3  column4
row1        1        2        3
row2        5        6        7
row3        9       10       11
row4       13       14       15
row5       17       18       19

In [20]:
# Converting Dataframes into Arrays

In [21]:
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [22]:
# to check for null values

In [24]:
df.isnull()

      column1  column2  column3  column4
row1    False    False    False    False
row2    False    False    False    False
row3    False    False    False    False
row4    False    False    False    False
row5    False    False    False    False

In [26]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [28]:
df['column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: column1, dtype: int64

In [29]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [30]:
df['column1'] # another way of feteching elements

row1     0
row2     4
row3     8
row4    12
row5    16
Name: column1, dtype: int32

In [33]:
df[['column1','column4']]

      column1  column4
row1        0        3
row2        4        7
row3        8       11
row4       12       15
row5       16       19